app/controllers/comments_controller.rb

  def index
    # @comments = Comment.all

    # render json: @comments


    @comments = Comment.where(post_id: @post.id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @comments = @post.comments.create(params.require(:comment).permit(:comment_text, :user_id, :post_id))
    if @comments.save
---
INSERT INTO "comments" ("comment_text", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_text", "tere"], ["user_id", 1], ["post_id", 1], ["created_at", "2020-05-15 17:51:37.453646"], ["updated_at", "2020-05-15 17:51:37.453646"]]

    def set_comment
      # p Comment.find(params[:id])
      @comment = Comment.find(params[:post_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]