app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 321], ["LIMIT", 1]]
---
def comments
  @title = "Comments"
  @user = User.find(params[:id])

INSERT INTO "posts" ("title", "description", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "wew"], ["description", "wwew"], ["image_url", "wewe"], ["user_id", 1], ["created_at", "2020-05-14 11:23:41.368907"], ["updated_at", "2020-05-14 11:23:41.368907"]]
---
  def create

    @post = Post.new(post_params)

    if @post.save

UPDATE "posts" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "twtwtwt"], ["description", "This is a frfrf of my post belonging to user3"], ["updated_at", "2020-05-17 04:52:04.723249"], ["id", 4]]
---
  def update
    if @post.update(post_params)