app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "12321as"], ["description", "desc"], ["image_url", "eqasxcavcs.png"], ["created_at", "2020-05-13 15:18:10.894486"], ["updated_at", "2020-05-13 15:18:10.894486"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
---
  def add_comment
    @comment = Comment.find(params[:comment_id])